MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ64GS406/mcu.h
#define _IPC18_PSESMIP0_POSITION                 0x00000004
#define _IPC18_PSESMIP0_MASK                     0x00000010
#define _IPC18_PSESMIP0_LENGTH                   0x00000001

#define _IPC18_PSESMIP1_POSITION                 0x00000005
#define _IPC18_PSESMIP1_MASK                     0x00000020
#define _IPC18_PSESMIP1_LENGTH                   0x00000001

#define _IPC18_PSESMIP2_POSITION                 0x00000006
#define _IPC18_PSESMIP2_MASK                     0x00000040
#define _IPC18_PSESMIP2_LENGTH                   0x00000001

#define _IPC21_ADCP12IP_POSITION                 0x00000004
#define _IPC21_ADCP12IP_MASK                     0x00000070
#define _IPC21_ADCP12IP_LENGTH                   0x00000003

#define _IPC21_ADCP12IP0_POSITION                0x00000004
#define _IPC21_ADCP12IP0_MASK                    0x00000010
#define _IPC21_ADCP12IP0_LENGTH                  0x00000001

#define _IPC21_ADCP12IP1_POSITION                0x00000005
#define _IPC21_ADCP12IP1_MASK                    0x00000020
#define _IPC21_ADCP12IP1_LENGTH                  0x00000001

#define _IPC21_ADCP12IP2_POSITION                0x00000006
#define _IPC21_ADCP12IP2_MASK                    0x00000040
#define _IPC21_ADCP12IP2_LENGTH                  0x00000001

#define _IPC23_PWM1IP_POSITION                   0x00000008
#define _IPC23_PWM1IP_MASK                       0x00000700
#define _IPC23_PWM1IP_LENGTH                     0x00000003

#define _IPC23_PWM2IP_POSITION                   0x0000000C
#define _IPC23_PWM2IP_MASK                       0x00007000
#define _IPC23_PWM2IP_LENGTH                     0x00000003

#define _IPC23_PWM1IP0_POSITION                  0x00000008
#define _IPC23_PWM1IP0_MASK                      0x00000100
#define _IPC23_PWM1IP0_LENGTH                    0x00000001

#define _IPC23_PWM1IP1_POSITION                  0x00000009
#define _IPC23_PWM1IP1_MASK                      0x00000200
#define _IPC23_PWM1IP1_LENGTH                    0x00000001

#define _IPC23_PWM1IP2_POSITION                  0x0000000A
#define _IPC23_PWM1IP2_MASK                      0x00000400
#define _IPC23_PWM1IP2_LENGTH                    0x00000001

#define _IPC23_PWM2IP0_POSITION                  0x0000000C
#define _IPC23_PWM2IP0_MASK                      0x00001000
#define _IPC23_PWM2IP0_LENGTH                    0x00000001

#define _IPC23_PWM2IP1_POSITION                  0x0000000D
#define _IPC23_PWM2IP1_MASK                      0x00002000
#define _IPC23_PWM2IP1_LENGTH                    0x00000001

#define _IPC23_PWM2IP2_POSITION                  0x0000000E
#define _IPC23_PWM2IP2_MASK                      0x00004000
#define _IPC23_PWM2IP2_LENGTH                    0x00000001

#define _IPC24_PWM3IP_POSITION                   0x00000000
#define _IPC24_PWM3IP_MASK                       0x00000007
#define _IPC24_PWM3IP_LENGTH                     0x00000003

#define _IPC24_PWM4IP_POSITION                   0x00000004
#define _IPC24_PWM4IP_MASK                       0x00000070
#define _IPC24_PWM4IP_LENGTH                     0x00000003

#define _IPC24_PWM5IP_POSITION                   0x00000008
#define _IPC24_PWM5IP_MASK                       0x00000700
#define _IPC24_PWM5IP_LENGTH                     0x00000003

#define _IPC24_PWM6IP_POSITION                   0x0000000C
#define _IPC24_PWM6IP_MASK                       0x00007000
#define _IPC24_PWM6IP_LENGTH                     0x00000003

#define _IPC24_PWM3IP0_POSITION                  0x00000000
#define _IPC24_PWM3IP0_MASK                      0x00000001
#define _IPC24_PWM3IP0_LENGTH                    0x00000001

#define _IPC24_PWM3IP1_POSITION                  0x00000001
#define _IPC24_PWM3IP1_MASK                      0x00000002
#define _IPC24_PWM3IP1_LENGTH                    0x00000001

#define _IPC24_PWM3IP2_POSITION                  0x00000002
#define _IPC24_PWM3IP2_MASK                      0x00000004
#define _IPC24_PWM3IP2_LENGTH                    0x00000001

#define _IPC24_PWM4IP0_POSITION                  0x00000004
#define _IPC24_PWM4IP0_MASK                      0x00000010
#define _IPC24_PWM4IP0_LENGTH                    0x00000001

#define _IPC24_PWM4IP1_POSITION                  0x00000005
#define _IPC24_PWM4IP1_MASK                      0x00000020
#define _IPC24_PWM4IP1_LENGTH                    0x00000001

#define _IPC24_PWM4IP2_POSITION                  0x00000006
#define _IPC24_PWM4IP2_MASK                      0x00000040
#define _IPC24_PWM4IP2_LENGTH                    0x00000001

#define _IPC24_PWM5IP0_POSITION                  0x00000008
#define _IPC24_PWM5IP0_MASK                      0x00000100
#define _IPC24_PWM5IP0_LENGTH                    0x00000001

#define _IPC24_PWM5IP1_POSITION                  0x00000009
#define _IPC24_PWM5IP1_MASK                      0x00000200
#define _IPC24_PWM5IP1_LENGTH                    0x00000001

#define _IPC24_PWM5IP2_POSITION                  0x0000000A
#define _IPC24_PWM5IP2_MASK                      0x00000400
#define _IPC24_PWM5IP2_LENGTH                    0x00000001

#define _IPC24_PWM6IP0_POSITION                  0x0000000C
#define _IPC24_PWM6IP0_MASK                      0x00001000
#define _IPC24_PWM6IP0_LENGTH                    0x00000001

#define _IPC24_PWM6IP1_POSITION                  0x0000000D
#define _IPC24_PWM6IP1_MASK                      0x00002000
#define _IPC24_PWM6IP1_LENGTH                    0x00000001

#define _IPC24_PWM6IP2_POSITION                  0x0000000E
#define _IPC24_PWM6IP2_MASK                      0x00004000
#define _IPC24_PWM6IP2_LENGTH                    0x00000001

#define _IPC27_ADCP0IP_POSITION                  0x00000008
#define _IPC27_ADCP0IP_MASK                      0x00000700
#define _IPC27_ADCP0IP_LENGTH                    0x00000003

#define _IPC27_ADCP1IP_POSITION                  0x0000000C
#define _IPC27_ADCP1IP_MASK                      0x00007000
#define _IPC27_ADCP1IP_LENGTH                    0x00000003

#define _IPC27_ADCP0IP0_POSITION                 0x00000008
#define _IPC27_ADCP0IP0_MASK                     0x00000100
#define _IPC27_ADCP0IP0_LENGTH                   0x00000001

#define _IPC27_ADCP0IP1_POSITION                 0x00000009
#define _IPC27_ADCP0IP1_MASK                     0x00000200
#define _IPC27_ADCP0IP1_LENGTH                   0x00000001

