MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ64GS406/mcu.h
#define _TRIG5_TRGCMP12_POSITION                 0x0000000F
#define _TRIG5_TRGCMP12_MASK                     0x00008000
#define _TRIG5_TRGCMP12_LENGTH                   0x00000001

#define _TRGCON5_TRGSTRT_POSITION                0x00000000
#define _TRGCON5_TRGSTRT_MASK                    0x0000003F
#define _TRGCON5_TRGSTRT_LENGTH                  0x00000006

#define _TRGCON5_DTM_POSITION                    0x00000007
#define _TRGCON5_DTM_MASK                        0x00000080
#define _TRGCON5_DTM_LENGTH                      0x00000001

#define _TRGCON5_TRGDIV_POSITION                 0x0000000C
#define _TRGCON5_TRGDIV_MASK                     0x0000F000
#define _TRGCON5_TRGDIV_LENGTH                   0x00000004

#define _TRGCON5_TRGSTRT0_POSITION               0x00000000
#define _TRGCON5_TRGSTRT0_MASK                   0x00000001
#define _TRGCON5_TRGSTRT0_LENGTH                 0x00000001

#define _TRGCON5_TRGSTRT1_POSITION               0x00000001
#define _TRGCON5_TRGSTRT1_MASK                   0x00000002
#define _TRGCON5_TRGSTRT1_LENGTH                 0x00000001

#define _TRGCON5_TRGSTRT2_POSITION               0x00000002
#define _TRGCON5_TRGSTRT2_MASK                   0x00000004
#define _TRGCON5_TRGSTRT2_LENGTH                 0x00000001

#define _TRGCON5_TRGSTRT3_POSITION               0x00000003
#define _TRGCON5_TRGSTRT3_MASK                   0x00000008
#define _TRGCON5_TRGSTRT3_LENGTH                 0x00000001

#define _TRGCON5_TRGSTRT4_POSITION               0x00000004
#define _TRGCON5_TRGSTRT4_MASK                   0x00000010
#define _TRGCON5_TRGSTRT4_LENGTH                 0x00000001

#define _TRGCON5_TRGSTRT5_POSITION               0x00000005
#define _TRGCON5_TRGSTRT5_MASK                   0x00000020
#define _TRGCON5_TRGSTRT5_LENGTH                 0x00000001

#define _TRGCON5_TRGDIV0_POSITION                0x0000000C
#define _TRGCON5_TRGDIV0_MASK                    0x00001000
#define _TRGCON5_TRGDIV0_LENGTH                  0x00000001

#define _TRGCON5_TRGDIV1_POSITION                0x0000000D
#define _TRGCON5_TRGDIV1_MASK                    0x00002000
#define _TRGCON5_TRGDIV1_LENGTH                  0x00000001

#define _TRGCON5_TRGDIV2_POSITION                0x0000000E
#define _TRGCON5_TRGDIV2_MASK                    0x00004000
#define _TRGCON5_TRGDIV2_LENGTH                  0x00000001

#define _TRGCON5_TRGDIV3_POSITION                0x0000000F
#define _TRGCON5_TRGDIV3_MASK                    0x00008000
#define _TRGCON5_TRGDIV3_LENGTH                  0x00000001

#define _STRIG5_STRGCMP_POSITION                 0x00000003
#define _STRIG5_STRGCMP_MASK                     0x0000FFF8
#define _STRIG5_STRGCMP_LENGTH                   0x0000000D

#define _STRIG5_STRGCMP0_POSITION                0x00000003
#define _STRIG5_STRGCMP0_MASK                    0x00000008
#define _STRIG5_STRGCMP0_LENGTH                  0x00000001

#define _STRIG5_STRGCMP1_POSITION                0x00000004
#define _STRIG5_STRGCMP1_MASK                    0x00000010
#define _STRIG5_STRGCMP1_LENGTH                  0x00000001

#define _STRIG5_STRGCMP2_POSITION                0x00000005
#define _STRIG5_STRGCMP2_MASK                    0x00000020
#define _STRIG5_STRGCMP2_LENGTH                  0x00000001

#define _STRIG5_STRGCMP3_POSITION                0x00000006
#define _STRIG5_STRGCMP3_MASK                    0x00000040
#define _STRIG5_STRGCMP3_LENGTH                  0x00000001

#define _STRIG5_STRGCMP4_POSITION                0x00000007
#define _STRIG5_STRGCMP4_MASK                    0x00000080
#define _STRIG5_STRGCMP4_LENGTH                  0x00000001

#define _STRIG5_STRGCMP5_POSITION                0x00000008
#define _STRIG5_STRGCMP5_MASK                    0x00000100
#define _STRIG5_STRGCMP5_LENGTH                  0x00000001

#define _STRIG5_STRGCMP6_POSITION                0x00000009
#define _STRIG5_STRGCMP6_MASK                    0x00000200
#define _STRIG5_STRGCMP6_LENGTH                  0x00000001

#define _STRIG5_STRGCMP7_POSITION                0x0000000A
#define _STRIG5_STRGCMP7_MASK                    0x00000400
#define _STRIG5_STRGCMP7_LENGTH                  0x00000001

#define _STRIG5_STRGCMP8_POSITION                0x0000000B
#define _STRIG5_STRGCMP8_MASK                    0x00000800
#define _STRIG5_STRGCMP8_LENGTH                  0x00000001

#define _STRIG5_STRGCMP9_POSITION                0x0000000C
#define _STRIG5_STRGCMP9_MASK                    0x00001000
#define _STRIG5_STRGCMP9_LENGTH                  0x00000001

#define _STRIG5_STRGCMP10_POSITION               0x0000000D
#define _STRIG5_STRGCMP10_MASK                   0x00002000
#define _STRIG5_STRGCMP10_LENGTH                 0x00000001

#define _STRIG5_STRGCMP11_POSITION               0x0000000E
#define _STRIG5_STRGCMP11_MASK                   0x00004000
#define _STRIG5_STRGCMP11_LENGTH                 0x00000001

#define _STRIG5_STRGCMP12_POSITION               0x0000000F
#define _STRIG5_STRGCMP12_MASK                   0x00008000
#define _STRIG5_STRGCMP12_LENGTH                 0x00000001

#define _LEBCON5_BPLL_POSITION                   0x00000000
#define _LEBCON5_BPLL_MASK                       0x00000001
#define _LEBCON5_BPLL_LENGTH                     0x00000001

#define _LEBCON5_BPLH_POSITION                   0x00000001
#define _LEBCON5_BPLH_MASK                       0x00000002
#define _LEBCON5_BPLH_LENGTH                     0x00000001

#define _LEBCON5_BPHL_POSITION                   0x00000002
#define _LEBCON5_BPHL_MASK                       0x00000004
#define _LEBCON5_BPHL_LENGTH                     0x00000001

#define _LEBCON5_BPHH_POSITION                   0x00000003
#define _LEBCON5_BPHH_MASK                       0x00000008
#define _LEBCON5_BPHH_LENGTH                     0x00000001

#define _LEBCON5_BCL_POSITION                    0x00000004
#define _LEBCON5_BCL_MASK                        0x00000010
#define _LEBCON5_BCL_LENGTH                      0x00000001

#define _LEBCON5_BCH_POSITION                    0x00000005
#define _LEBCON5_BCH_MASK                        0x00000020
#define _LEBCON5_BCH_LENGTH                      0x00000001

#define _LEBCON5_CLLEBEN_POSITION                0x0000000A
#define _LEBCON5_CLLEBEN_MASK                    0x00000400
#define _LEBCON5_CLLEBEN_LENGTH                  0x00000001

